label/AV_Request.xml

Request: 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:ns2="http://www.ups.com/XMLSchema/XOLTWS/xav/v1.0" xmlns:ns3="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0"><SOAP-ENV:Header><ns3:UPSSecurity><ns3:UsernameToken><ns3:Username>elephxp</ns3:Username><ns3:Password>ABC123efg@</ns3:Password></ns3:UsernameToken><ns3:ServiceAccessToken><ns3:AccessLicenseNumber>1D7F00B3B06A9135</ns3:AccessLicenseNumber></ns3:ServiceAccessToken></ns3:UPSSecurity></SOAP-ENV:Header><SOAP-ENV:Body><ns2:XAVRequest><ns1:Request><ns1:RequestOption>3</ns1:RequestOption></ns1:Request><ns2:MaximumCandidateListSize>1</ns2:MaximumCandidateListSize><ns2:AddressKeyFormat><ns2:ConsigneeName>Peter Yuan</ns2:ConsigneeName><ns2:AddressLine>5640 West Market Street</ns2:AddressLine><ns2:AddressLine>Apt C</ns2:AddressLine><ns2:AddressLine></ns2:AddressLine><ns2:PoliticalDivision2>Greensboro</ns2:PoliticalDivision2><ns2:PoliticalDivision1>NC</ns2:PoliticalDivision1><ns2:PostcodePrimaryLow>27409</ns2:PostcodePrimaryLow><ns2:PostcodeExtendedLow></ns2:PostcodeExtendedLow><ns2:Region>Greensboro,NC,27409</ns2:Region><ns2:CountryCode>US</ns2:CountryCode></ns2:AddressKeyFormat></ns2:XAVRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>

Response: 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><xav:XAVResponse xmlns:xav="http://www.ups.com/XMLSchema/XOLTWS/xav/v1.0"><common:Response xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0"><common:ResponseStatus><common:Code>1</common:Code><common:Description>Success</common:Description></common:ResponseStatus></common:Response><xav:ValidAddressIndicator/><xav:AddressClassification><xav:Code>2</xav:Code><xav:Description>Residential</xav:Description></xav:AddressClassification><xav:Candidate><xav:AddressClassification><xav:Code>2</xav:Code><xav:Description>Residential</xav:Description></xav:AddressClassification><xav:AddressKeyFormat><xav:AddressLine>5640 W MARKET ST</xav:AddressLine><xav:AddressLine>APT C</xav:AddressLine><xav:PoliticalDivision2>GREENSBORO</xav:PoliticalDivision2><xav:PoliticalDivision1>NC</xav:PoliticalDivision1><xav:PostcodePrimaryLow>27409</xav:PostcodePrimaryLow><xav:PostcodeExtendedLow>2425</xav:PostcodeExtendedLow><xav:Region>GREENSBORO NC 27409-2425</xav:Region><xav:CountryCode>US</xav:CountryCode></xav:AddressKeyFormat></xav:Candidate></xav:XAVResponse></soapenv:Body></soapenv:Envelope>
